Revit 2027 API
FabricationConfigurationInfo.GetProfiles Method
 Return the profiles in the fabrication configuration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetProfiles()
Public Function GetProfiles As IList(Of String)
public:
IList<String^>^ GetProfiles()
member GetProfiles : unit -> IList<string>
Return Value
IList<String>
Remarks
 The global profile name is empty, and is not returned here.
See Also
Reference
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace